book/programming-psychology-experiments.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-23 Thu 16:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming Psychology Experiments</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Programming Psychology Experiments</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org25d667d">1. Programming Psychology Experiments in Python</a>
<ul>
<li><a href="#orgee412dd">1.1. Why Program Your Psychology Experiment</a></li>
<li><a href="#org7837a0d">1.2. Which language?</a>
<ul>
<li><a href="#orgb014c87">1.2.1. Python</a></li>
<li><a href="#orgcaad257">1.2.2. What about Javascript?</a></li>
</ul>
</li>
<li><a href="#orgc385eef">1.3. Programming Psychology Experiments With PsychoPy</a>
<ul>
<li><a href="#org22db439">1.3.1. Installing Psychopy</a></li>
</ul>
</li>
<li><a href="#org3af4c70">1.4. What is <code>pip</code>?</a>
<ul>
<li><a href="#org45d7c11">1.4.1. Testing Your PsychoPy Installation</a></li>
<li><a href="#orgbb29607">1.4.2. Resources for Psychopy.</a></li>
<li><a href="#org793f360">1.4.3. Psychopy Exercise</a></li>
<li><a href="#org0848c53">1.4.4. Extending the Exercise</a></li>
<li><a href="#org4902c7a">1.4.5. Simple Tutorials from Psychopy</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5974fc9">2. Assessement Psychopy</a>
<ul>
<li><a href="#org03afb95">2.1. Task</a></li>
<li><a href="#orgb7e067c">2.2. Objective</a></li>
<li><a href="#org43a8a9d">2.3. Detailed Instructions</a></li>
<li><a href="#orge6ac2dc">2.4. Hints</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org25d667d" class="outline-2">
<h2 id="org25d667d"><span class="section-number-2">1.</span> Programming Psychology Experiments in Python</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgee412dd" class="outline-3">
<h3 id="orgee412dd"><span class="section-number-3">1.1.</span> Why Program Your Psychology Experiment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you use a graphical environment to design your experiment you will be limited to the potential elements and structures that were envisioned by the developers of that graphical programming environment. While this will cover many popular cases, it will probably not cover all of them. The designers of these programs spend their time thinking about the most common uses. But that means if you try to do something particularly new or novel you may spend your time trying to figure out how to shoehorn your experimental idea into the limits of a graphical design language instead of using the design elements to meet your experimental requirements. If you can write your own code you will be able to augment the code output by a graphical program. And if none of the pre-packaged experiments fit your needs you will be able to build what you need to pursue your experimental ambitions. The question then becomes what language to use for programming your own experiments?
</p>

  <div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/469970965?h=7271813760" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/469970965">La : Intro to Prog Experiments (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Programming experiments for psychology; which language and how to use the PsychoPy library.</p>
</div>
</div>

<div id="outline-container-org7837a0d" class="outline-3">
<h3 id="org7837a0d"><span class="section-number-3">1.2.</span> Which language?</h3>
<div class="outline-text-3" id="text-1-2">
<div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/469970967?h=7611824ab1" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/469970967">Lb : Which Language Should I use? (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Deciding to program your own experiments is the first step. Choosing the language to use is the second.</p>
</div>

<div id="outline-container-orgb014c87" class="outline-4">
<h4 id="orgb014c87"><span class="section-number-4">1.2.1.</span> Python</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
As we have seen python is a widely popular programming language. It has good library support for a wide range of general programming needs and it can also be used for data analysis and plotting. Thus, time spent learning to program your experiments in python will also be useful for other scientific tasks such as plotting your data or analyzing your data. In addition, non-experimental computing work you may need to do will likely also be helped by knowing more python. 
</p>
</div>
<ol class="org-ol">
<li><a id="org21a7044"></a>Domain support<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
While the reasons above make python a good first language to consider for any coding project the ultimate selection should consider whether there is good library support for your particular needs. In the case of psychology there is an excellent well supported library, <a href="https://www.psychopy.org">PsychoPy</a>.
</p>

<p>
Psychopy has the ability to make deploying complex visual stimuli relatively easy, and it can also be used as the basis for scaffolding other tools such as eye trackers and EEG machines. R does not have the same level of support. Other languages that do, such as <a href="https://www.mathworks.com/products/matlab.html">MatLab</a> (with its <a href="http://psychtoolbox.org/">PsychToolbox</a>)are proprietary, and less general purpose though they are very powerful tools for modeling, simulation, and data analysis.
</p>

<p>
While any general purpose programming language could, in principle, work for any purpose when choosing a programming language for your project consider the following:
</p>
<ul class="org-ul">
<li>access
Will you and your users have access? This might be relevant when using a language that is proprietary, has a small user base, or is difficult to install and use because of limited tooling. You might also want to try and think whether the trajectory of the language is one that leads you to believe it will be around in years to come,</li>
<li>expertise &amp; experience
Your project will go better if you are writing in a language you know and for which you have local sources that you can consult for advice,</li>
<li>quality libraries
If someone has already largely solved your problem, then don't reinvent the wheel, but use your time to develop the modifications needed to fit your specific need.</li>
</ul>
</div>
</li>
</ol>
</div>
