book/programming-psychology-experiments.html
<div id="outline-container-orgcaad257" class="outline-4">
<h4 id="orgcaad257"><span class="section-number-4">1.2.2.</span> What about Javascript?</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Writing in 2020 when many psychology labs are closed to in-person studies, the ability to design and deliver experiments remotely, on-line, has great appeal. <a href="https://www.javascript.com/">JavaScript</a> is the language of active elements on the web, and therefore deserves definite consideration. Javascript as a language has matured, gotten faster, and extended itself to multiple programming paradigms. There are even variants that enforce a static type system and that can let you find bugs in the compilation stage rather than at run time. <a href="https://www.typescriptlang.org/">Typescript</a> is the principle example. There are good libraries for developing psychology experiments with JavaScript as well. The people who produce PsychoPy have a graphical front-end that generates javascript output (<a href="https://github.com/psychopy/psychojs">psychojs</a>). And the closely named <a href="https://www.jspsych.org/">JSPsych</a> has great support for writing code using the traditional elements of psychology. In my lab some students prefer to write native Javascript while others find the JSPsych library to be convenient, simple, and meeting their needs.
</p>

<p>
However, I do not recommend javascript as your first or primary programming language for two principal reasons. One, if you are a beginner, JavaScript adds another level of domain knowledge you need to know to code your experiment effectively. You have to have some familiarity with web browsers and what constitutes a web page. What is HTML and how is the web page, as a document, constructed (the DOM )? Learning all that at the same time makes for a higher hurdle. If getting your experiment up and running for on-line use is your specific need then it certainly is doable, but it makes for a harder start. Also, you won't be able to write the simple scripts and general purpose programs in javascript that you can in other languages. The expertise you develop in javascript may not transfer as directly to other languages and other types of applications. Your knowledge will be more selective, and more specific to the web. That is a large and popular area to be restricted to, but it is still narrower than I recommend for a first language.
</p>

<p>
The second consideration concerns longevity. I read many blog posts by people who hate to program in javascript. I read very few by those who love it. It is hard enough to learn to code without adding the barrier of being forced to struggle with an unappealing language. There are active efforts to let you write in other languages that then <i>transpile</i> to javascript. As one example, <a href="https://elm-lang.org/">Elm</a> is a language that compiles to javascript, but which you write with a different language. However, <code>Elm</code> is still close enough to programming for the web that all the knowledge of HTML and DOM is still beneficial.
</p>

<p>
Javascript and its limits have also built momentum for a successor language: <a href="https://webassembly.org/">Web Assembly</a> (aka WASM). Web Assembly may well supersede much writing in javascript (even if javascript appears in the final compiled product), and web assembly makes it easier for computer scientists to produce <span class="underline">transpilers</span>: tools that allow you to code in one language and output code in another. Right now certain aspects of Python prevent easy transpilation from python to web assembly, but development is active and this may well not be the case in the near future. Thus, your expertise in python would allow you to work on general programs and may well allow you to code for the web more easily in the future. Therefore, I feel the first, best choice, for learning to code experiments for psychology right now is Python.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc385eef" class="outline-3">
<h3 id="orgc385eef"><span class="section-number-3">1.3.</span> Programming Psychology Experiments With PsychoPy</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Before we can use the psychopy library we have to install it. This used to be a big hurdle, but lately it has become much easier. 
</p>
</div>

<div id="outline-container-org22db439" class="outline-4">
<h4 id="org22db439"><span class="section-number-4">1.3.1.</span> Installing Psychopy</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="org78e4264"></a><b>Important Message</b> Spring 2023 <i>Please read if you are using a VM</i><br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
The world of computing changes quickly. In March of 2023 I tried to install Psychopy's latest version in a Ubuntu 22.04 VM running on an M2 Mac and also on a Windows 11 VM. In both cases I was not able to get it working without important errors. This does not mean that it cannot be done, it just means that it would require considerably more work than we have time for, and would require digging into details that may not transfer to future use cases. Even if you figured it out it will probably be different a year from now. Some of the challenge is running everything in a VM which puts one more level of indirection between us and our program. So, for now, Spring 2023 if you are a VM you will want to install the "standalone" version. The following video shows me doing this on a Mac, but the process is similar on a Windows machine. Note that you still <b>cannot</b> use the builder for your homework or for building your experiment to run in class.
</p>

<div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/810622435?h=45aa642eb0" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/810622435">Getting Psychopy on the New Macs (M!/2)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>What you can do if you need Psychopy on an M1/2 Mac (applicable to running a VM on Windows 11 as well)</p>
</div>
</li>
