chapters/programming-psychology-experiments.org
**** Non-VM Installation

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262765?h=9964ab1ae4" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262765">Lc : Installing Psychopy (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>How do you install psychopy on Xubuntu, and how can you see if you have a functioning installation?</p>
#+end_export

Instructions for installation of PsychoPy can be found via the [[https://www.psychopy.org/index.html][home page]].

Given the difficulties with VM installation I verified (2023) that Psychopy does install quite easily on a machine running Linux if it isn't also running Windows or OSX. The instructions are basically as above, but may involve one or two small tweaks as shown in the video below. Note that this video was made on a decades old laptop so that the video quality and audio quality are not great.

#+begin_export html
<div style="padding:56.34% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/811064510?h=bb3c4ae6d2" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/811064510">Psychopy and Linux 2023</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Verifying an installation of Psychopy on Xubuntu 22.04, and a couple of tiny tweaks, in 2023.</p>
#+end_export

Basically we can use `pip` to grab and install almost all the elements we need. First verify you have pip installed ~pip --version~ from the command line of a terminal will suffice. Then you can use it to grab psychopy and /almost/ all of its dependencies. There are a lot of them and this process will take some time. Be patient.
   
   #+begin_src sh :eval never
   pip install psychopy
   #+end_src

Note the instructions about getting a wx wheel. [[https://wxpython.org/][WX]] is a graphical user interface toolkit that psychopy uses for some elements. Psychopy recommends getting the wx kit you need (for us at this time it is ubuntu 20.04) from [[https://extras.wxpython.org/wxPython4/extras/linux/gtk3/][here.]] After you have downloaded and expanded that directory you will need to repeat the ~pip~ command, but be careful. Here you are installing a particular version and file. You need to follow your ~pip install~ command with the path that leads to the specific .whl file you just downloaded.

   Everything may run at this point, but to get the best support for precise timing and sound the PsychoPy developers currently recommend installing some libraries from the Ubuntu repositories using your ~apt~ skills (~apt-get~ is a bit like ~apt~ and was the forerunner - you can just use ~apt~ in its place).

   #+begin_src sh :eval never
   sudo apt-get install libusb-1.0-0-dev portaudio19-dev libasound2-dev
   #+end_src

** What is ~pip~?
   ~pip~ is a program for installing python packages. The python package installation procedure is a long, varied, and ever changing one, but for right now ~pip~ is an excellent choice that gets packages from a curated and vetted source. You can read more about it [[https://www.w3schools.com/python/python_pip.asp][here]] and [[https://realpython.com/what-is-pip/][here]].
*** Testing Your PsychoPy Installation
**** Use the Psychopy Demos
Purpose: Demonstrate that you have psychopy installed and functioning

If you have psychopy correctly installed you should be able to run some of the demo programs to learn about its capabilities.

First, navigate to where the package is installed. Open a terminal and ~cd~ to the directory where the program installed. On my computer on (<2020-10-15 Thu>) this is: =~/.lib/python3.6/site-packages/psychopy/demos/coder/stimuli/=

*Note* that that line contains a python version number. If you have a different version of python you will probably need to edit that line to use the correct python version for your machine.

If you run ~ls~ in this directory you will see all the demos. Run one. I particularily like     ~python3 face_jpg.py~. If that works try some more, then ...
**** Activity
    ... change something.

    Open up one of the file in Emacs (or another text editor) and look at the python code. Try changing something and then running your new version.
***** Tips
     1. Don't directly edit the working file. Create a copy and edit that. That way if you mess something up you still have the original.
     2. Start small. Change the window size for example or try to see if you can change the background color.
     3. The *API* is your friend.
	API stands for application program (or programmer) interface. It is your guide to what each function is, what it does, what it expects, and what, if anything, it outputs. The API for psychopy is [[https://www.psychopy.org/api/index.html][here.]] But every significant library will have something like this.

     Moral: Never hesitate to look at the source code!	
	
*** Resources for Psychopy.
   1. The authors of the Psychopy library have written an entire [[https://us.sagepub.com/en-us/nam/building-experiments-in-psychopy/book253480#contents][textbook]] on using python for psychology experiments that includes the online extensions. That is a good resource to pursue things after this course. It is focused more on the /builder/ interface than the /coder/ interface.
   2. On the psychopy website is an [[https://www.psychopy.org/coder/index.html#coder][introduction]] to using the coder component of psychopy.
   3. Searching online with ~psychopy tutorial~ will get you a variety of hits. Note that you want to emphasize the ~coder~ version. Maybe the ~builder~ will meet your needs, but better to start with the ~coder~ version and use the ~builder~ for efficiency. In many cases it will be harder to build a complex experiment in the ~builder~ than by directly using the ~coder~ version.
