book/programming-psychology-experiments.html

<li><a id="orgad269e8"></a>Non-VM Installation<br />
<div class="outline-text-5" id="text-1-3-1-2">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262765?h=9964ab1ae4" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262765">Lc : Installing Psychopy (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>How do you install psychopy on Xubuntu, and how can you see if you have a functioning installation?</p>

<p>
Instructions for installation of PsychoPy can be found via the <a href="https://www.psychopy.org/index.html">home page</a>.
</p>

<p>
Given the difficulties with VM installation I verified (2023) that Psychopy does install quite easily on a machine running Linux if it isn't also running Windows or OSX. The instructions are basically as above, but may involve one or two small tweaks as shown in the video below. Note that this video was made on a decades old laptop so that the video quality and audio quality are not great.
</p>

<div style="padding:56.34% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/811064510?h=bb3c4ae6d2" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/811064510">Psychopy and Linux 2023</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Verifying an installation of Psychopy on Xubuntu 22.04, and a couple of tiny tweaks, in 2023.</p>

<p>
Basically we can use `pip` to grab and install almost all the elements we need. First verify you have pip installed <code>pip --version</code> from the command line of a terminal will suffice. Then you can use it to grab psychopy and <i>almost</i> all of its dependencies. There are a lot of them and this process will take some time. Be patient.
</p>

<div class="org-src-container">
<pre class="src src-sh">pip install psychopy
</pre>
</div>

<p>
Note the instructions about getting a wx wheel. <a href="https://wxpython.org/">WX</a> is a graphical user interface toolkit that psychopy uses for some elements. Psychopy recommends getting the wx kit you need (for us at this time it is ubuntu 20.04) from <a href="https://extras.wxpython.org/wxPython4/extras/linux/gtk3/">here.</a> After you have downloaded and expanded that directory you will need to repeat the <code>pip</code> command, but be careful. Here you are installing a particular version and file. You need to follow your <code>pip install</code> command with the path that leads to the specific .whl file you just downloaded.
</p>

<p>
Everything may run at this point, but to get the best support for precise timing and sound the PsychoPy developers currently recommend installing some libraries from the Ubuntu repositories using your <code>apt</code> skills (<code>apt-get</code> is a bit like <code>apt</code> and was the forerunner - you can just use <code>apt</code> in its place).
</p>


<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install libusb-1.0-0-dev portaudio19-dev libasound2-dev
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org3af4c70" class="outline-3">
<h3 id="org3af4c70"><span class="section-number-3">1.4.</span> What is <code>pip</code>?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>pip</code> is a program for installing python packages. The python package installation procedure is a long, varied, and ever changing one, but for right now <code>pip</code> is an excellent choice that gets packages from a curated and vetted source. You can read more about it <a href="https://www.w3schools.com/python/python_pip.asp">here</a> and <a href="https://realpython.com/what-is-pip/">here</a>.
</p>
</div>
<div id="outline-container-org45d7c11" class="outline-4">
<h4 id="org45d7c11"><span class="section-number-4">1.4.1.</span> Testing Your PsychoPy Installation</h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
<ol class="org-ol">
<li><a id="org1a18bec"></a>Use the Psychopy Demos<br />
<div class="outline-text-5" id="text-1-4-1-1">
<p>
Purpose: Demonstrate that you have psychopy installed and functioning
</p>

<p>
If you have psychopy correctly installed you should be able to run some of the demo programs to learn about its capabilities.
</p>

<p>
First, navigate to where the package is installed. Open a terminal and <code>cd</code> to the directory where the program installed. On my computer on <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-03-23 Thu&gt; </span></span> this is: <code>~/.local/lib/python3.10/site-packages/psychopy/demos/coder/stimuli/</code>
</p>

<p>
<b>Note</b> that that line contains a python version number. If you have a different version of python you will probably need to edit that line to use the correct python version for your machine.
</p>

<p>
If you run <code>ls</code> in this directory you will see all the demos. Run one. I particularily like     <code>python3 face_jpg.py</code>. If that works try some more, then &#x2026;
</p>
</div>
</li>
<li><a id="orgd9832e6"></a>Activity<br />
<div class="outline-text-5" id="text-1-4-1-2">
<p>
&#x2026; change something.
</p>

<p>
Open up one of the file in Emacs (or another text editor) and look at the python code. Try changing something and then running your new version.
</p>
</div>
<ol class="org-ol">
<li><a id="org9f8bc0d"></a>Tips<br />
<div class="outline-text-6" id="text-1-4-1-2-1">
<ol class="org-ol">
<li>Don't directly edit the working file. Create a copy and edit that. That way if you mess something up you still have the original.</li>
<li>Start small. Change the window size for example or try to see if you can change the background color.</li>
<li>The <b>API</b> is your friend.
API stands for application program (or programmer) interface. It is your guide to what each function is, what it does, what it expects, and what, if anything, it outputs. The API for psychopy is <a href="https://www.psychopy.org/api/index.html">here.</a> But every significant library will have something like this.</li>
</ol>

<p>
Moral: Never hesitate to look at the source code!	
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orgbb29607" class="outline-4">
<h4 id="orgbb29607"><span class="section-number-4">1.4.2.</span> Resources for Psychopy.</h4>
<div class="outline-text-4" id="text-1-4-2">
<ol class="org-ol">
<li>The authors of the Psychopy library have written an entire <a href="https://us.sagepub.com/en-us/nam/building-experiments-in-psychopy/book253480#contents">textbook</a> on using python for psychology experiments that includes the online extensions. That is a good resource to pursue things after this course. It is focused more on the <i>builder</i> interface than the <i>coder</i> interface.</li>
<li>On the psychopy website is an <a href="https://www.psychopy.org/coder/index.html#coder">introduction</a> to using the coder component of psychopy.</li>
<li>Searching online with <code>psychopy tutorial</code> will get you a variety of hits. Note that you want to emphasize the <code>coder</code> version. Maybe the <code>builder</code> will meet your needs, but better to start with the <code>coder</code> version and use the <code>builder</code> for efficiency. In many cases it will be harder to build a complex experiment in the <code>builder</code> than by directly using the <code>coder</code> version.</li>
</ol>
</div>
</div>
