chapters/programming-psychology-experiments.org
*** Psychopy Exercise 
   This exercise is intended to give you a minimalist introduction to using the most basic elements of the psychopy library. The large ~psychopy~ package has several submodules. You can import them selectively, and then you don't have quite as much "bloat." That is what is going in the line that starts "from" below.
   From there, have fun!

   1. Open up a terminal.
   2. Begin a python session
   3. ~from psychopy import visual,core~
   4. Create a window
      ~mywin = visual.Window(size = (640,480))~
   5. Test it
      ~mywin.flip()~
   6. Why is it called /flip/?
   7. Add a red rectangle.
      ~myrect = visual.Rect(mywin, linewidth = 0, fillcolor = "red", size = [.2,.2],pos=[0,0],units="norm")~
   8. Draw it
      ~myrect.draw()~
   9. Show it
      ~mywin.flip()~
   10. Clean up and shut down in an orderly way
       ~core.quit()~

*** Extending the Exercise
   To do this you will probably need to consult the [[https://www.psychopy.org/api/index.html][psychopy API.]]
   Can you?
   1. Change the color of the square.
   2. Move the Square.
   3. Add some text
   4. Keep the window open for a certain amount of time, and then close it when that time has elapsed.
*** Simple Tutorials from Psychopy
   1. [[https://www.psychopy.org/coder/tutorial1.html][Here]] is the first
   2. [[https://www.psychopy.org/coder/tutorial2.html][A formula for JND]]


* Assessement Psychopy

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262765?h=9964ab1ae4" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262765">Lc : Installing Psychopy (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>How do you install psychopy on Xubuntu, and how can you see if you have a functioning installation?</p>
#+end_export

** Task
  Submit a .py file that demonstrates a minimal version of a single trial of a Posner cuing task.
  
** Objective
  To familiarize yourself with the basic elements of the psychopy library and how to combine a few of them into something that could become a psychology experiment. We will use the [[https://en.wikipedia.org/wiki/Posner_cueing_task][Posner Cuing]] task for this project.

** Detailed Instructions
  Provide me with a python file that,
  1. Imports the psychopy library elements (and any other necessary libraries) in order to,
  2. Places a white cross (or plus sign) at the center of the screen. Make the cross white and the background gray. Imagine the cross is to be our "fixation spot."
  3. After a delay a white square appears to the right or left of fixation (the side to be chose randomly on each trial).
  4. 200 ms after the white square appears a black dot (or filled circle) appears either in the center of the white square or equidistant on the other side. The first if a "valid" cue condition, and the second is "invalid."
  5. Require the user/participant to press the z button on the keyboard if the target (black dot) is on the left and the "/" key if the target is on the right.
  6. After the keypress print to the screen which key was pressed and how much time elapsed between the appearance of the black dot and the key press. This is your reaction time (RT).
  7. _Optional_ if that comes very quickly make a loop to do this ten times and write the results to a file rather than putting them on the screen.

** Hints
  The following psychopy objects may be useful.
  1. Visual.window
  2. Visual.TextStim
  3. Visual.ShapeStim or Visual.Circle
  4. Core.Quit
  5. Clock.Clock
  6. Clock.getTime
  7. Clock.wait
  8. Event.getKeys
     
