book/programming-psychology-experiments.html
<div id="outline-container-org793f360" class="outline-4">
<h4 id="org793f360"><span class="section-number-4">1.4.3.</span> Psychopy Exercise</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
This exercise is intended to give you a minimalist introduction to using the most basic elements of the psychopy library. The large <code>psychopy</code> package has several submodules. You can import them selectively, and then you don't have quite as much "bloat." That is what is going in the line that starts "from" below.
From there, have fun!
</p>

<ol class="org-ol">
<li>Open up a terminal.</li>
<li>Begin a python session</li>
<li><code>from psychopy import visual,core</code></li>
<li>Create a window
<code>mywin = visual.Window(size = (640,480))</code></li>
<li>Test it
<code>mywin.flip()</code></li>
<li>Why is it called <i>flip</i>?</li>
<li>Add a red rectangle.
<code>myrect = visual.Rect(mywin, linewidth = 0, fillcolor = "red", size = [.2,.2],pos=[0,0],units="norm")</code></li>
<li>Draw it
<code>myrect.draw()</code></li>
<li>Show it
<code>mywin.flip()</code></li>
<li>Clean up and shut down in an orderly way
<code>core.quit()</code></li>
</ol>
</div>
</div>

<div id="outline-container-org0848c53" class="outline-4">
<h4 id="org0848c53"><span class="section-number-4">1.4.4.</span> Extending the Exercise</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
To do this you will probably need to consult the <a href="https://www.psychopy.org/api/index.html">psychopy API.</a>
Can you?
</p>
<ol class="org-ol">
<li>Change the color of the square.</li>
<li>Move the Square.</li>
<li>Add some text</li>
<li>Keep the window open for a certain amount of time, and then close it when that time has elapsed.</li>
</ol>
</div>
</div>
<div id="outline-container-org4902c7a" class="outline-4">
<h4 id="org4902c7a"><span class="section-number-4">1.4.5.</span> Simple Tutorials from Psychopy</h4>
<div class="outline-text-4" id="text-1-4-5">
<ol class="org-ol">
<li><a href="https://www.psychopy.org/coder/tutorial1.html">Here</a> is the first</li>
<li><a href="https://www.psychopy.org/coder/tutorial2.html">A formula for JND</a></li>
</ol>
</div>
</div>
</div>
</div>


<div id="outline-container-org5974fc9" class="outline-2">
<h2 id="org5974fc9"><span class="section-number-2">2.</span> Assessement Psychopy</h2>
<div class="outline-text-2" id="text-2">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262765?h=9964ab1ae4" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262765">Lc : Installing Psychopy (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>How do you install psychopy on Xubuntu, and how can you see if you have a functioning installation?</p>
</div>

<div id="outline-container-org03afb95" class="outline-3">
<h3 id="org03afb95"><span class="section-number-3">2.1.</span> Task</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Submit a .py file that demonstrates a minimal version of a single trial of a Posner cuing task.
</p>
</div>
</div>

<div id="outline-container-orgb7e067c" class="outline-3">
<h3 id="orgb7e067c"><span class="section-number-3">2.2.</span> Objective</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To familiarize yourself with the basic elements of the psychopy library and how to combine a few of them into something that could become a psychology experiment. We will use the <a href="https://en.wikipedia.org/wiki/Posner_cueing_task">Posner Cuing</a> task for this project.
</p>
</div>
</div>

<div id="outline-container-org43a8a9d" class="outline-3">
<h3 id="org43a8a9d"><span class="section-number-3">2.3.</span> Detailed Instructions</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Provide me with a python file that,
</p>
<ol class="org-ol">
<li>Imports the psychopy library elements (and any other necessary libraries) in order to,</li>
<li>Places a white cross (or plus sign) at the center of the screen. Make the cross white and the background gray. Imagine the cross is to be our "fixation spot."</li>
<li>After a delay a white square appears to the right or left of fixation (the side to be chose randomly on each trial).</li>
<li>200 ms after the white square appears a black dot (or filled circle) appears either in the center of the white square or equidistant on the other side. The first if a "valid" cue condition, and the second is "invalid."</li>
<li>Require the user/participant to press the z button on the keyboard if the target (black dot) is on the left and the "/" key if the target is on the right.</li>
<li>After the keypress print to the screen which key was pressed and how much time elapsed between the appearance of the black dot and the key press. This is your reaction time (RT).</li>
<li><span class="underline">Optional</span> if that comes very quickly make a loop to do this ten times and write the results to a file rather than putting them on the screen.</li>
</ol>
</div>
</div>

<div id="outline-container-orge6ac2dc" class="outline-3">
<h3 id="orge6ac2dc"><span class="section-number-3">2.4.</span> Hints</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The following psychopy objects may be useful.
</p>
<ol class="org-ol">
<li>Visual.window</li>
<li>Visual.TextStim</li>
<li>Visual.ShapeStim or Visual.Circle</li>
<li>Core.Quit</li>
<li>Clock.Clock</li>
<li>Clock.getTime</li>
<li>Clock.wait</li>
<li>Event.getKeys</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-14 Tue 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-03-23 Thu 16:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>